Autodesk.Revit.DB.Architecture.BalusterInfo.GetReferenceNameForTopRail
Gets the name string to be used as a reference to Top Rail in the current language.
Remarks:
This name can be used in the setter for Autodesk.Revit.DB.Architecture.BalusterInfo.BaseReferenceName
or Autodesk.Revit.DB.Architecture.BalusterInfo.TopReferenceName.
The name can also be compared with the value coming from the getter.
Returns:
The name string to be used as a reference to Top Rail.
Since:
2020

Autodesk.Revit.DB.Architecture.BalusterInfo.GetReferenceNameForHost
Gets the name string to be used as a reference to Host in the current language.
Remarks:
This name can be used in the setter for Autodesk.Revit.DB.Architecture.BalusterInfo.BaseReferenceName
or Autodesk.Revit.DB.Architecture.BalusterInfo.TopReferenceName.
The name can also be compared with the value coming from the getter.
Returns:
The name string to be used as a reference to Host.
Since:
2020

Autodesk.Revit.DB.Architecture.BalusterInfo.TopReferenceName
Represents the name of the reference for the top of this baluster or post.
Remarks:
Two pre-defined reference names can be obtained using Autodesk::Revit::DB::Architecture::BalusterInfo::getReferenceNameForHost() or
Autodesk::Revit::DB::Architecture::BalusterInfo::getReferenceNameForTopRail().
The rest of valid reference names that are allowed to be used in the setter for TopReferenceName
are the actual names of non-continuous rails Autodesk::Revit::DB::Architecture::NonContinuousRailInfo::Name
in Autodesk::Revit::DB::Architecture::NonContinuousRailStructure
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The name doesn't refer to a valid reference.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Architecture.BalusterInfo.BaseReferenceName
Represents the name of the reference for the bottom of this baluster or post.
Remarks:
Two pre-defined reference names can be obtained using Autodesk::Revit::DB::Architecture::BalusterInfo::getReferenceNameForHost() or
Autodesk::Revit::DB::Architecture::BalusterInfo::getReferenceNameForTopRail().
The rest of valid reference names that are allowed to be used in the setter for BaseReferenceName
are the actual names of non-continuous rails Autodesk::Revit::DB::Architecture::NonContinuousRailInfo::Name
in Autodesk::Revit::DB::Architecture::NonContinuousRailStructure
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The name doesn't refer to a valid reference.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Architecture.BalusterInfo.Name
The name of the baluster.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: name is an empty string or contains only whitespace.
-or-
When setting this property: name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Architecture.BalusterInfo.BalusterFamilyId
The id of the family used for the baluster or post.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The balusterFamilyId doesn't refer to a valid baluster family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2019